#+title: Notes & Documentation
#+author: Cristian Moreno - Kyonax

* TABLE OF CONTENTS :toc:
- [[#keybindings][Keybindings]]
  - [[#important-applications-to-have-in-mind][Important Applications to have in mind]]
  - [[#dwm][DWM]]
  - [[#how-to-patch-suckless][How to Patch Suckless]]
  - [[#videos-that-im-watching][Videos that Im watching]]

* Keybindings
** Important Applications to have in mind
| Application Name              | Use for                      |
|-------------------------------+------------------------------|
| pactl                         | The Controller of PulseAudio |
| Pulse Audio                   | Audio Drivers                |
| xev -event keyboard           | Program to see the name keys |
| sudo timedatectl set-ntp true | Synchronize the Time         |
| fc-list                       | get the font list            |
|                               |                              |


/testing/ *testing*

#+begin_src js
const currencyFormat = new Intl.NumberFormat('es-US', {
    style: 'currency',
    currency: 'USD'
}), movil_price = 23000000, bank = 30000000 , cuota = 0, months = 36, impuestos = 13;


console.log(`CUOTA_M: ${currencyFormat.format((bank/months)+(bank*0.13)/months)}`);
#+end_src

#+RESULTS:
: CUOTA_M: $941,666.67
: undefined

#+begin_src js
let years = 11, km = 172000;

console.log(km/years);
#+end_src

#+RESULTS:
: 15636.363636363636
: undefined

#+begin_quote
        Testing the Thing of Quoting
#+end_quote

#+begin_src javascript
const test = "testing";

if (test != "testing") {
    console.log("testing");
}
#+end_src

** DWM
Things to have in mind to use ~dwm~

| Command          | Use                                    |
|------------------+----------------------------------------|
| Alt+p            | Open the menu to search something      |
| Alt+Shift+Enter  | Open Terminal                          |
| Shift+j Shift+k  | Move between split windows             |
| Alt+Shift+Number | Move Window to ant other Windows Space |
| Alt+Enter        | Become Window to Master                |
| Alt+f            | Float Mode on Window                   |

** How to Patch Suckless
*** AlwaysCenter
*** UselessGaps
*** AttachBelow
New Window go below not become to the new Master

** Videos that Im watching
| URL                                                       | Additional Information   |
|-----------------------------------------------------------+--------------------------|
| [[https://www.youtube.com/watch?v=PmZAxNSdkQ8&t=637s][Sxhkd: Configuring Window Manager Independent Keybindings]] | Examples for Keybindings |
| [[https://www.youtube.com/watch?v=6vTrVPpNodI][Making a DWM Status Bar and Adding the Bling]]              | Code Blocks on DWM       |
